In [116]:
list=[1,2,3,"dit"]
print(list)

[1, 2, 3, 'dit']

In [117]:
tuple=(1,2,3,"dit")
print(tuple)

(1, 2, 3, 'dit')

In [118]:
tuple[0:-1]

(1, 2, 3)

In [119]:
dic={"roll":[1,2,3],"name":["ram","shyam","vats"]}

In [120]:
print(dic)

{'roll': [1, 2, 3], 'name': ['ram', 'shyam', 'vats']}

In [121]:
print(dic["roll"])
print(dic["name"])

[1, 2, 3]
['ram', 'shyam', 'vats']

In [122]:
import pandas as pd
import numpy as np

In [123]:
s=pd.Series([10,20,23],index=[1,2,3])
print(s)

1    10
2    20
3    23
dtype: int64

In [124]:
data={"sno":[1,2,3,4,5,6,7],
      "roll":[11,12,13,14,15,16,17],
      "name":["ram" , "shyam" , "vats" , "shrey" , "vansh" , "negi" , "aman"],
      "branch":["it" , "it" , "it" , "me" , "cse" , "cse" , np.nan],
      "sem":[4,5,5,6,7,5, np.nan]}

In [125]:
print(data)

{'sno': [1, 2, 3, 4, 5, 6, 7], 'roll': [11, 12, 13, 14, 15, 16, 17], 'name': ['ram', 'shyam', 'vats', 'shrey', 'vansh', 'negi', 'aman'], 'branch': ['it', 'it', 'it', 'me', 'cse', 'cse', nan], 'sem': [4, 5, 5, 6, 7, 5, nan]}

In [126]:
df=pd.DataFrame(data)
print(df)

   sno  roll   name branch  sem
0    1    11    ram     it  4.0
1    2    12  shyam     it  5.0
2    3    13   vats     it  5.0
3    4    14  shrey     me  6.0
4    5    15  vansh    cse  7.0
5    6    16   negi    cse  5.0
6    7    17   aman    NaN  NaN

In [127]:
df.loc[0:4]

   sno  roll   name branch  sem
0    1    11    ram     it  4.0
1    2    12  shyam     it  5.0
2    3    13   vats     it  5.0
3    4    14  shrey     me  6.0
4    5    15  vansh    cse  7.0

In [128]:
df.iloc[0:4]

   sno  roll   name branch  sem
0    1    11    ram     it  4.0
1    2    12  shyam     it  5.0
2    3    13   vats     it  5.0
3    4    14  shrey     me  6.0

In [129]:
df.drop("sno",axis=1)

   roll   name branch  sem
0    11    ram     it  4.0
1    12  shyam     it  5.0
2    13   vats     it  5.0
3    14  shrey     me  6.0
4    15  vansh    cse  7.0
5    16   negi    cse  5.0
6    17   aman    NaN  NaN

In [137]:
df["branch"].fillna("cse",inplace=True)
df["sem"].fillna("4",inplace=True)
print(df)

   sno  roll   name branch  sem
0    1    11    ram     it  4.0
1    2    12  shyam     it  5.0
2    3    13   vats     it  5.0
3    4    14  shrey     me  6.0
4    5    15  vansh    cse  7.0
5    6    16   negi    cse  5.0
6    7    17   aman    cse    4

In [131]:
df.drop(5,axis=0)

   sno  roll   name branch  sem
0    1    11    ram     it  4.0
1    2    12  shyam     it  5.0
2    3    13   vats     it  5.0
3    4    14  shrey     me  6.0
4    5    15  vansh    cse  7.0
6    7    17   aman    NaN  NaN

In [160]:
sec={"section":["a","a","c","c","d","b","b"]}
sec=pd.DataFrame(sec)

C:\Users\DIT\AppData\Local\Temp\ipykernel_9344\2542250832.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(sec)

   sno  roll   name branch  sem section
0  1.0  11.0    ram     it  4.0       a
1  2.0  12.0  shyam     it  5.0       a
2  3.0  13.0   vats     it  5.0       c
3  4.0  14.0  shrey     me  6.0       c
4  5.0  15.0  vansh    cse  7.0       d
5  6.0  16.0   negi    cse  5.0       d
6  7.0  17.0   aman    cse    4       b
0  NaN   NaN    NaN    NaN  NaN       a
1  NaN   NaN    NaN    NaN  NaN       a
2  NaN   NaN    NaN    NaN  NaN       c
3  NaN   NaN    NaN    NaN  NaN       c
4  NaN   NaN    NaN    NaN  NaN       d
5  NaN   NaN    NaN    NaN  NaN       b
6  NaN   NaN    NaN    NaN  NaN       b

In [153]:
df

   sno  roll   name branch  sem section
0    1    11    ram     it  4.0       a
1    2    12  shyam     it  5.0       a
2    3    13   vats     it  5.0       c
3    4    14  shrey     me  6.0       c
4    5    15  vansh    cse  7.0       d
5    6    16   negi    cse  5.0       d
6    7    17   aman    cse    4       b